cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap "homebrew/services"

brew 'ack'
brew "btop"
brew "coreutils"
brew "curl"
brew "ffmpeg"
brew 'grep'
brew 'tailscale'
brew 'imagemagick'
brew 'postgresql@17'
brew 'redis'
brew 'python@3.14'
brew 'uv'
brew 'spaceman-diff' # A tool for viewing git diffs in a more readable format
brew 'spark'
brew 'wget'
brew "node"
brew 'yt-dlp'
brew 'claude'
brew 'neovim'
brew 'bitwarden'
brew 'tree'

cask 'font-caskaydia-cove-nerd-font'
cask 'handbrake'
cask 'messenger'
cask 'synergy'
cask 'plex'
cask 'qlvideo' # QuickLook plugin for various video formats
cask 'steam'
cask 'transmission'
cask 'raycast'
cask 'warp' # Modern Rust-based terminal with GPU acceleration, autocomplete, and collaboration features
cask 'whatsapp'
cask 'windsurf'
cask 'visual-studio-code'
cask 'cursor'
cask 'telegram'
cask 'brave-browser'
cask 'rustdesk'
cask 'discord'
cask 'vlc'
cask 'zed' # High-performance code editor with real-time collaboration
